In [66]:
import pandas as pd
import numpy as np

In [67]:
# help(pd.DataFrame())

# 通过二维数组创建dataframe

In [68]:
df01 = pd.DataFrame([['joe','susam','anne'],[70,80,90]],index=['Name','Score'],columns=['c','d','e'])
df01

         c      d     e
Name   joe  susam  anne
Score   70     80    90

# 通过字典创建

In [69]:
#字典中的value只能是一维数组
df01 = pd.DataFrame({
    
    'name':['joe','susan','anne'],
    'sex':['mem','women','men'],
    'age':[18,19,20],
    'classid':3
},index=['one','two','three'])
print(df01)

       age  classid   name    sex
one     18        3    joe    mem
two     19        3  susan  women
three   20        3   anne    men

In [70]:
#列索引获取数据
df01['name']

one        joe
two      susan
three     anne
Name: name, dtype: object

In [71]:
df01['address']=['上海','北京','天津']
df01

       age  classid   name    sex address
one     18        3    joe    mem      上海
two     19        3  susan  women      北京
three   20        3   anne    men      天津

In [72]:
df01.pop('address')

one      上海
two      北京
three    天津
Name: address, dtype: object

In [73]:
#行获取
df01.ix['one']

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

age         18
classid      3
name       joe
sex        mem
Name: one, dtype: object

In [74]:
df01.loc['two']

age           19
classid        3
name       susan
sex        women
Name: two, dtype: object

In [75]:
df01.loc['two']['name']

'susan'

In [76]:
#行删除
df01.drop('three')

     age  classid   name    sex
one   18        3    joe    mem
two   19        3  susan  women

In [77]:
df01

       age  classid   name    sex
one     18        3    joe    mem
two     19        3  susan  women
three   20        3   anne    men

In [78]:
df01.ix['four'] = np.NaN

In [79]:
df01

        age  classid   name    sex
one    18.0      3.0    joe    mem
two    19.0      3.0  susan  women
three  20.0      3.0   anne    men
four    NaN      NaN    NaN    NaN

In [80]:
# df01['four']=[100,100,100,100]

In [81]:
df01

        age  classid   name    sex
one    18.0      3.0    joe    mem
two    19.0      3.0  susan  women
three  20.0      3.0   anne    men
four    NaN      NaN    NaN    NaN

In [86]:
df01.ix['four']=[20,10,'hcc','man']

In [87]:
df01

        age  classid   name    sex
one    18.0      3.0    joe    mem
two    19.0      3.0  susan  women
three  20.0      3.0   anne    men
four   20.0     10.0    hcc    man